Config/DataProcessors/CheckReservationWaitingList.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>CheckReservationWaitingList</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReservationDepartment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Departments</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataProcessor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DataProcessors</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/InformationRegisters/ReservationWaitingList.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ReservationWaitingList</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Rating</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ready</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Reservation</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Reservation</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/AccomodationTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AccomodationTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Room</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Beds</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Together</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AdditionalBed</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/Message.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Message</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Messages</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ActivityEndTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ActivityStartTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>B24TaskID</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ByObject</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GuestGroups</v8:Type>
						<v8:Type>cfg:DocumentRef.Settlement</v8:Type>
						<v8:Type>cfg:CatalogRef.Rooms</v8:Type>
						<v8:Type>cfg:DocumentRef.Accommodation</v8:Type>
						<v8:Type>cfg:DocumentRef.IssueHotelProducts</v8:Type>
						<v8:Type>cfg:DocumentRef.Order</v8:Type>
						<v8:Type>cfg:CatalogRef.Contracts</v8:Type>
						<v8:Type>cfg:DocumentRef.CloseOfCashRegisterDay</v8:Type>
						<v8:Type>cfg:DocumentRef.SetRoomQuota</v8:Type>
						<v8:Type>cfg:DocumentRef.SetPriceTagRanges</v8:Type>
						<v8:Type>cfg:DocumentRef.SetRoomRatePrices</v8:Type>
						<v8:Type>cfg:DocumentRef.Reservation</v8:Type>
						<v8:Type>cfg:DocumentRef.ProformaInvoice</v8:Type>
						<v8:Type>cfg:CatalogRef.Customers</v8:Type>
						<v8:Type>cfg:DocumentRef.Folio</v8:Type>
						<v8:Type>cfg:DocumentRef.ForeignerRegistryRecord</v8:Type>
						<v8:Type>cfg:DocumentRef.ResourceReservation</v8:Type>
						<v8:Type>cfg:CatalogRef.Resources</v8:Type>
						<v8:Type>cfg:CatalogRef.Clients</v8:Type>
						<v8:Type>cfg:CatalogRef.CashRegisters</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ByOrder</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Order</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ClosedBy</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CloseToDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Color</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ColorHexString</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContactPerson</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Clients</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateWhenClosed</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ForDepartment</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Departments</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ForEmployee</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Employees</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsClosed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MessageStatus</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.MessageStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>MessageType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.MessageTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ParentDoc</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Message</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Phone2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PopUp</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Position</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReservationTaskArea</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ReservationTaskAreas</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SendBySMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SMSIsSent</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Type</Name>
					<Type>
						<v8:Type>cfg:EnumRef.MessageTypes</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ValidFromDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ValidToDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BedsSetup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.BedsSetups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RoomStatus</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.RoomStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Comments</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Period</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Employee</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Employees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Comments</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>MessageStatus</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.MessageStatuses</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ForEmployees</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Employee</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Employees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ForDepartments</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Department</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Departments</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Operations</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Employee</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Employees</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Operation</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Operations</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Quantity</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Price</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OperationStartTime</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>OperationEndTime</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Duration</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>EmployeeOperation</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.EmployeeOperation</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/DataProcessors/CheckReservationWaitingList/Ext/ObjectModule.bsl
#Region Public

// ----------------------------------------------------------------------------
//
// Parameters:
//  pParameter	 - Structure - Parameter 
//
Procedure pmLoadDataProcessorAttributes(pParameter = Undefined) Export
	cmLoadDataProcessorAttributes(ThisObject, pParameter);
EndProcedure // pmLoadDataProcessorAttributes

// ----------------------------------------------------------------------------
//
Procedure pmSaveDataProcessorAttributes() Export
	cmSaveDataProcessorAttributes(ThisObject);
EndProcedure // pmSaveDataProcessorAttributes

// ----------------------------------------------------------------------------
//  Initialize attributes with default values
//  Attention: This procedure could be called AFTER some attributes initialization
//  routine, so it SHOULD NOT reset attributes being set before
//  ----------------------------------------------------------------------------
//
Procedure pmFillAttributesWithDefaultValues() Export
	If Not ValueIsFilled(Hotel) Then
		Hotel = SessionParameters.CurrentHotel;
		If ValueIsFilled(Hotel) Then
			ReservationDepartment = Hotel.ReservationDepartment;
		EndIf;
	EndIf;
EndProcedure //  pmFillAttributesWithDefaultValues

// ----------------------------------------------------------------------------
//  Run data processor in silent mode
//  ----------------------------------------------------------------------------
//
// Parameters:
//  pParameter		 - Null	 - Parameter
//  pIsInteractive	 - Boolean	 - Is interactive
//
Procedure pmRun(pParameter = Undefined, pIsInteractive = False) Export
	// Check reservation waiting list
	pmCheck(pIsInteractive);
EndProcedure // pmRun

// ----------------------------------------------------------------------------
//
// Parameters:
//  pIsInteractive	 - Boolean	 - Is interactive
//
Procedure pmCheck(pIsInteractive = False) Export
	WriteLogEvent(NStr("en = 'DataProcessor.CheckReservationWaitingList'; de = 'DataProcessor.CheckReservationWaitingList'; ru = 'Обработка.ПроверкаЛистаОжиданияБрони'"), EventLogLevel.Information, Metadata(), Undefined, NStr("en = 'Start of processing'; de = 'Anfang der Ausführung'; ru = 'Начало выполнения'"));
	// Get up to date reservations in the waiting list
	vQry = New Query();
	vQry.Text = 
	"SELECT
	|	ReservationWaitingList.Reservation AS Reservation,
	|	ReservationWaitingList.Rating AS Rating,
	|	ReservationWaitingList.Ready AS Ready
	|FROM
	|	InformationRegister.ReservationWaitingList AS ReservationWaitingList
	|WHERE
	|	ReservationWaitingList.Active
	|	AND (ReservationWaitingList.Reservation.Hotel = &qHotel
	|			OR &qHotelIsEmpty)
	|	AND ReservationWaitingList.Reservation.CheckInDate >= &qCurrentDate
	|	AND (ReservationWaitingList.Reservation.AccommodationType.Type = VALUE(Enum.AccomodationTypes.Room)
	|			OR ReservationWaitingList.Reservation.AccommodationType.Type = VALUE(Enum.AccomodationTypes.Beds))";
	vQry.SetParameter("qHotel", Hotel);
	vQry.SetParameter("qHotelIsEmpty", Not ValueIsFilled(Hotel));
	vQry.SetParameter("qCurrentDate", CurrentSessionDate());
	vReservations = vQry.Execute().Unload();
	// Check notification transport type
	For Each vReservationsRow In vReservations Do 
		vReservationRef = vReservationsRow.Reservation;
		vNewReservationStatus = vReservationRef.Hotel.NewReservationStatus;
		If Not ValueIsFilled(vReservationRef) Then
			Continue;
		EndIf;
		If Not ValueIsFilled(vNewReservationStatus) Then
			Continue;
		EndIf;
		If Not vNewReservationStatus.IsActive Then
			Continue;
		EndIf;
		BeginTransaction(DataLockControlMode.Managed);
		Try
			// Change reservation status and try to post it
			vReservationObj = vReservationRef.GetObject();
			vReservationObj.ReservationStatus = vNewReservationStatus;
			vReservationObj.pmCalculateResources();
			vReservationObj.Write(DocumentWriteMode.Posting);
			// Check room quota inventory balances
			If ValueIsFilled(vReservationObj.RoomQuota) Then
				vMsgTextRu = "";
				vMsgTextEn = "";
				vMsgTextDe = "";
				If Not cmCheckRoomQuotaAvailability(vReservationObj.RoomQuota.Agent, vReservationObj.RoomQuota.Customer, vReservationObj.RoomQuota.Contract, vReservationObj.RoomQuota, 
				                                    vReservationObj.Hotel, vReservationObj.RoomType, vReservationObj.Room, vReservationObj.Ref, True, True,
				                                    vReservationObj.NumberOfRooms, vReservationObj.NumberOfBeds, 
				                                    cmMovePeriodFromToReferenceHour(vReservationObj.CheckInDate, vReservationObj.RoomRate), 
				                                    cmMovePeriodToToReferenceHour(vReservationObj.CheckOutDate, vReservationObj.RoomRate), 
				                                    vMsgTextRu, vMsgTextEn, vMsgTextDe, False) Then
					Raise NStr("ru = '" + TrimAll(vMsgTextRu) + "';" + "en = '" + TrimAll(vMsgTextEn) + "';" + "de = '" + TrimAll(vMsgTextDe) + "';");
				EndIf;
			EndIf;
			// Check room inventory balances
			If Not ValueIsFilled(vReservationObj.RoomQuota) Or ValueIsFilled(vReservationObj.Room) Then
				vMsgTextRu = "";
				vMsgTextEn = "";
				vMsgTextDe = "";
				If Not cmCheckRoomAvailability(vReservationObj.Hotel, vReservationObj.RoomQuota, vReservationObj.RoomType, vReservationObj.Room, vReservationObj.Ref, True, True,
				                               vReservationObj.NumberOfPersons, vReservationObj.NumberOfRooms, vReservationObj.NumberOfBeds, vReservationObj.NumberOfAdditionalBeds, 
				                               vReservationObj.NumberOfBedsPerRoom, vReservationObj.NumberOfPersonsPerRoom, Max(CurrentSessionDate(), vReservationObj.CheckInDate), vReservationObj.CheckOutDate, 
				                               vMsgTextRu, vMsgTextEn, vMsgTextDe, False, False, True) Then
					Raise NStr("ru = '" + TrimAll(vMsgTextRu) + "';" + "en = '" + TrimAll(vMsgTextEn) + "';" + "de = '" + TrimAll(vMsgTextDe) + "';");
				EndIf;
			EndIf;
			// Roll back transaction if all checks has passed
			RollbackTransaction();
			// Log current state
			vMessage = NStr("en='Reservation could be confirmed: ';ru='Бронь может быть подтверждена: ';de='Die Reservierung kann bestätigt werden: '") + Chars.LF +
			           Format(vReservationRef.GuestGroup.Code, "ND=12; NFD=0; NG=") + ", " +
			           Format(vReservationRef.CheckInDate, "DF='dd.MM.yyyy HH:mm'") + " - " + Format(vReservationRef.CheckOutDate, "DF='dd.MM.yyyy HH:mm'") + ", " +
			           TrimAll(vReservationRef.RoomType) + ", " + TrimAll(vReservationRef.Room) + Chars.LF +
			           TrimAll(vReservationRef.Hotel) + " / " + TrimAll(vReservationRef.Author);
			WriteLogEvent(NStr("en = 'DataProcessor.CheckReservationWaitingList'; de = 'DataProcessor.CheckReservationWaitingList'; ru = 'Обработка.ПроверкаЛистаОжиданияБрони'"), EventLogLevel.Information, Metadata(), vReservationRef, vMessage);
			If pIsInteractive Then
				tcCommonFunctionOnClientServer.UserMessage(vMessage);
			EndIf;
			// Update current waiting list record status
			UpdateWaitingListRecordStatus(vReservationRef);
			// Write notification message
			If ValueIsFilled(ReservationDepartment) Then
				If CheckMessageToDepartment(ReservationDepartment, vReservationRef, "%" + vMessage + "%") Then
					cmSendMessageToDepartment(ReservationDepartment, vMessage, Undefined, True, vReservationRef);
				EndIf;
			EndIf;
		Except
			vMessage = cmGetRootErrorDescription(ErrorInfo());
			If TransactionActive() Then
				RollbackTransaction();
			EndIf; 
			UpdateWaitingListRecordStatus(vReservationRef, False); 
			CloseMessageToDepartment(ReservationDepartment, vReservationRef, "%" + vMessage + "%");
			WriteLogEvent(NStr("en = 'DataProcessor.CheckReservationWaitingList'; de = 'DataProcessor.CheckReservationWaitingList'; ru = 'Обработка.ПроверкаЛистаОжиданияБрони'"), EventLogLevel.Information, Metadata(), vReservationRef, vMessage);
			// Exit
			If pIsInteractive Then
				tcCommonFunctionOnClientServer.UserMessage(vMessage);
			EndIf;
		EndTry;
	EndDo;
	WriteLogEvent(NStr("en = 'DataProcessor.CheckReservationWaitingList'; de = 'DataProcessor.CheckReservationWaitingList'; ru = 'Обработка.ПроверкаЛистаОжиданияБрони'"), EventLogLevel.Information, Metadata(), Undefined, NStr("en = 'End of processing'; de = 'Ende des Ausführung'; ru = 'Конец выполнения'"));
EndProcedure // pmCheck

#EndRegion

#Region Private

// ----------------------------------------------------------------------------
Function CheckMessageToDepartment(pReservationDepartment, pReservation, pMessage)
	vQ = New Query();
	vQ.Text = 
	"SELECT
	|	Message.Ref AS Ref
	|FROM
	|	Document.Message AS Message
	|WHERE
	|	Message.Posted
	|	AND NOT Message.DeletionMark
	|	AND NOT Message.IsClosed
	|	AND Message.ByObject = &qByObject
	|	AND Message.ForDepartment = &qForDepartment
	|	AND Message.Remarks LIKE &qRemarks";
	vQ.SetParameter("qByObject", pReservation);
	vQ.SetParameter("qForDepartment", pReservationDepartment);
	vQ.SetParameter("qRemarks", TrimAll(pMessage));
	Return vQ.Execute().IsEmpty();
EndFunction // CheckMessageToDepartment

// ----------------------------------------------------------------------------
Procedure CloseMessageToDepartment(pReservationDepartment, pReservation, pMessage)
	vQ = New Query(); 
	vQ.Text = 
	"SELECT
	|	Message.Ref AS Ref
	|FROM
	|	Document.Message AS Message
	|WHERE
	|	Message.Posted
	|	AND NOT Message.DeletionMark
	|	AND NOT Message.IsClosed
	|	AND Message.ByObject = &qByObject
	|	AND Message.ForDepartment = &qForDepartment
	|	AND Message.Remarks LIKE &qRemarks";
	vQ.SetParameter("qByObject", pReservation);
	vQ.SetParameter("qForDepartment", pReservationDepartment);
	vQ.SetParameter("qRemarks", TrimAll(pMessage));
	vMessages = vQ.Execute().Unload();
	For Each vMessage In vMessages Do
		vMsgObj = vMessage.Ref.GetObject();
		vMsgObj.IsClosed = True;
		vMsgObj.PopUp = False;
		vMsgObj.Remarks = vMsgObj.Remarks + Chars.LF + Format(CurrentSessionDate(), "DF='dd.MM.yyyy HH:mm:ss'") + NStr("en = ' Not available rooms'; de = 'Nicht verfügbare Zimmer'; ru = 'Нет свободных номеров'");
		vMsgObj.Write(DocumentWriteMode.Posting);
	EndDo;
EndProcedure // DeleteMessageToDepartment

// ----------------------------------------------------------------------------
Procedure UpdateWaitingListRecordStatus(pReservation, pReady = True)
	// Update current attachment status
	vSet = InformationRegisters.ReservationWaitingList.CreateRecordSet();
	vSet.Filter.Recorder.Value = pReservation;
	vSet.Filter.Recorder.ComparisonType = ComparisonType.Equal;
	vSet.Filter.Recorder.Use = True;
	vSet.Read();
	For Each vSetRow In vSet Do
		vSetRow.Ready = pReady;
	EndDo;
	vSet.Write();
EndProcedure //  UpdateWaitingListRecordStatus

#EndRegion
